HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEIM_USP_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEIM_USP_ADDR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEIM_USP_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEIM_USP_ADDR_OFF (4u)

/** \brief Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEIM_IM_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEIM_IM_ADDR_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEIM_IM_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEIM_IM_ADDR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEIM_IM_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEIM_IM_ADDR_OFF (5u)

/** \brief Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEIM_USP_BE */
#define IFX_GTM_IRQ_FORCINT_TRG_AEIM_USP_BE_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEIM_USP_BE */
#define IFX_GTM_IRQ_FORCINT_TRG_AEIM_USP_BE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEIM_USP_BE */
#define IFX_GTM_IRQ_FORCINT_TRG_AEIM_USP_BE_OFF (6u)

/** \brief Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_CLK_EN_ERR */
#define IFX_GTM_IRQ_FORCINT_TRG_CLK_EN_ERR_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_CLK_EN_ERR */
#define IFX_GTM_IRQ_FORCINT_TRG_CLK_EN_ERR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_CLK_EN_ERR */
#define IFX_GTM_IRQ_FORCINT_TRG_CLK_EN_ERR_OFF (7u)

/** \brief Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_CLK_PER_ERR */
#define IFX_GTM_IRQ_FORCINT_TRG_CLK_PER_ERR_LEN (1u)

/** \brief Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_CLK_PER_ERR */
#define IFX_GTM_IRQ_FORCINT_TRG_CLK_PER_ERR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_CLK_PER_ERR */
#define IFX_GTM_IRQ_FORCINT_TRG_CLK_PER_ERR_OFF (8u)

/** \brief Length for Ifx_GTM_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_IRQ_MODE_IRQ_MODE_LEN (2u)

/** \brief Mask for Ifx_GTM_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_IRQ_MODE_IRQ_MODE_MSK (0x3u)

/** \brief Offset for Ifx_GTM_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_IRQ_MODE_IRQ_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_EIRQ_EN_Bits.AEI_TO_XPT_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_TO_XPT_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_TO_XPT_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_TO_XPT_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_TO_XPT_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_TO_XPT_EIRQ_EN_OFF (0u)

/** \brief Length for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_OFF (1u)

/** \brief Length for Ifx_GTM_EIRQ_EN_Bits.AEI_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_IM_ADDR_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_IM_ADDR_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_IM_ADDR_EIRQ_EN_OFF (2u)

/** \brief Length for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_OFF (3u)

/** \brief Length for Ifx_GTM_EIRQ_EN_Bits.AEIM_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEIM_USP_ADDR_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_EIRQ_EN_Bits.AEIM_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEIM_USP_ADDR_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_EIRQ_EN_Bits.AEIM_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEIM_USP_ADDR_EIRQ_EN_OFF (4u)

/** \brief Length for Ifx_GTM_EIRQ_EN_Bits.AEIM_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEIM_IM_ADDR_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_EIRQ_EN_Bits.AEIM_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEIM_IM_ADDR_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_EIRQ_EN_Bits.AEIM_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEIM_IM_ADDR_EIRQ_EN_OFF (5u)

/** \brief Length for Ifx_GTM_EIRQ_EN_Bits.AEIM_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEIM_USP_BE_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_EIRQ_EN_Bits.AEIM_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEIM_USP_BE_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_EIRQ_EN_Bits.AEIM_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEIM_USP_BE_EIRQ_EN_OFF (6u)

/** \brief Length for Ifx_GTM_EIRQ_EN_Bits.CLK_EN_ERR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_CLK_EN_ERR_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_EIRQ_EN_Bits.CLK_EN_ERR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_CLK_EN_ERR_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_EIRQ_EN_Bits.CLK_EN_ERR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_CLK_EN_ERR_EIRQ_EN_OFF (7u)

/** \brief Length for Ifx_GTM_EIRQ_EN_Bits.CLK_PER_ERR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_CLK_PER_ERR_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_EIRQ_EN_Bits.CLK_PER_ERR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_CLK_PER_ERR_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_EIRQ_EN_Bits.CLK_PER_ERR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_CLK_PER_ERR_EIRQ_EN_OFF (8u)

/** \brief Length for Ifx_GTM_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_HW_CONF_GRSTEN_LEN (1u)

/** \brief Mask for Ifx_GTM_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_HW_CONF_GRSTEN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_HW_CONF_GRSTEN_OFF (0u)

/** \brief Length for Ifx_GTM_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_HW_CONF_BRIDGE_MODE_RST_LEN (1u)

/** \brief Mask for Ifx_GTM_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_HW_CONF_BRIDGE_MODE_RST_MSK (0x1u)

/** \brief Offset for Ifx_GTM_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_HW_CONF_BRIDGE_MODE_RST_OFF (1u)

/** \brief Length for Ifx_GTM_HW_CONF_Bits.SYNC_INPUT_REG */
#define IFX_GTM_HW_CONF_SYNC_INPUT_REG_LEN (1u)

/** \brief Mask for Ifx_GTM_HW_CONF_Bits.SYNC_INPUT_REG */
#define IFX_GTM_HW_CONF_SYNC_INPUT_REG_MSK (0x1u)

/** \brief Offset for Ifx_GTM_HW_CONF_Bits.SYNC_INPUT_REG */
#define IFX_GTM_HW_CONF_SYNC_INPUT_REG_OFF (2u)

