HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS5_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS5_CLK_DIV_OFF (10u)

/** \brief Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH0 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH0_LEN (2u)

/** \brief Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH0 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH0 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH0_OFF (0u)

/** \brief Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH1 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH1_LEN (2u)

/** \brief Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH1 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH1 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH1_OFF (2u)

/** \brief Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH2 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH2_LEN (2u)

/** \brief Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH2 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH2 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH2_OFF (4u)

/** \brief Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH3 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH3_LEN (2u)

/** \brief Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH3 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH3 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH3_OFF (6u)

/** \brief Length for Ifx_GTM_TBU_CH0_CTRL_Bits.LOW_RES */
#define IFX_GTM_TBU_CH0_CTRL_LOW_RES_LEN (1u)

/** \brief Mask for Ifx_GTM_TBU_CH0_CTRL_Bits.LOW_RES */
#define IFX_GTM_TBU_CH0_CTRL_LOW_RES_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TBU_CH0_CTRL_Bits.LOW_RES */
#define IFX_GTM_TBU_CH0_CTRL_LOW_RES_OFF (0u)

/** \brief Length for Ifx_GTM_TBU_CH0_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH0_CTRL_CH_CLK_SRC_LEN (3u)

/** \brief Mask for Ifx_GTM_TBU_CH0_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH0_CTRL_CH_CLK_SRC_MSK (0x7u)

/** \brief Offset for Ifx_GTM_TBU_CH0_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH0_CTRL_CH_CLK_SRC_OFF (1u)

/** \brief Length for Ifx_GTM_TBU_CH0_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH0_BASE_BASE_LEN (27u)

/** \brief Mask for Ifx_GTM_TBU_CH0_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH0_BASE_BASE_MSK (0x7ffffffu)

/** \brief Offset for Ifx_GTM_TBU_CH0_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH0_BASE_BASE_OFF (0u)

/** \brief Length for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH1_CTRL_CH_MODE_LEN (1u)

/** \brief Mask for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH1_CTRL_CH_MODE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH1_CTRL_CH_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH1_CTRL_CH_CLK_SRC_LEN (3u)

/** \brief Mask for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH1_CTRL_CH_CLK_SRC_MSK (0x7u)

/** \brief Offset for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH1_CTRL_CH_CLK_SRC_OFF (1u)

/** \brief Length for Ifx_GTM_TBU_CH1_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH1_BASE_BASE_LEN (24u)

/** \brief Mask for Ifx_GTM_TBU_CH1_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH1_BASE_BASE_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_TBU_CH1_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH1_BASE_BASE_OFF (0u)

/** \brief Length for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH2_CTRL_CH_MODE_LEN (1u)

/** \brief Mask for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH2_CTRL_CH_MODE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH2_CTRL_CH_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH2_CTRL_CH_CLK_SRC_LEN (3u)

/** \brief Mask for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH2_CTRL_CH_CLK_SRC_MSK (0x7u)

/** \brief Offset for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH2_CTRL_CH_CLK_SRC_OFF (1u)

/** \brief Length for Ifx_GTM_TBU_CH2_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH2_BASE_BASE_LEN (24u)

/** \brief Mask for Ifx_GTM_TBU_CH2_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH2_BASE_BASE_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_TBU_CH2_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH2_BASE_BASE_OFF (0u)

/** \brief Length for Ifx_GTM_TBU_CH3_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH3_CTRL_CH_MODE_LEN (1u)

/** \brief Mask for Ifx_GTM_TBU_CH3_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH3_CTRL_CH_MODE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TBU_CH3_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH3_CTRL_CH_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_TBU_CH3_CTRL_Bits.USE_CH2 */
#define IFX_GTM_TBU_CH3_CTRL_USE_CH2_LEN (1u)

/** \brief Mask for Ifx_GTM_TBU_CH3_CTRL_Bits.USE_CH2 */
#define IFX_GTM_TBU_CH3_CTRL_USE_CH2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TBU_CH3_CTRL_Bits.USE_CH2 */
#define IFX_GTM_TBU_CH3_CTRL_USE_CH2_OFF (4u)

/** \brief Length for Ifx_GTM_TBU_CH3_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH3_BASE_BASE_LEN (24u)

/** \brief Mask for Ifx_GTM_TBU_CH3_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH3_BASE_BASE_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_TBU_CH3_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH3_BASE_BASE_OFF (0u)

/** \brief Length for Ifx_GTM_TBU_CH3_BASE_MARK_Bits.BASE_MARK */
#define IFX_GTM_TBU_CH3_BASE_MARK_BASE_MARK_LEN (24u)

/** \brief Mask for Ifx_GTM_TBU_CH3_BASE_MARK_Bits.BASE_MARK */
#define IFX_GTM_TBU_CH3_BASE_MARK_BASE_MARK_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_TBU_CH3_BASE_MARK_Bits.BASE_MARK */
#define IFX_GTM_TBU_CH3_BASE_MARK_BASE_MARK_OFF (0u)

/** \brief Length for Ifx_GTM_TBU_CH3_BASE_CAPTURE_Bits.BASE_CAPTURE */
#define IFX_GTM_TBU_CH3_BASE_CAPTURE_BASE_CAPTURE_LEN (24u)

/** \brief Mask for Ifx_GTM_TBU_CH3_BASE_CAPTURE_Bits.BASE_CAPTURE */
#define IFX_GTM_TBU_CH3_BASE_CAPTURE_BASE_CAPTURE_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_TBU_CH3_BASE_CAPTURE_Bits.BASE_CAPTURE */
#define IFX_GTM_TBU_CH3_BASE_CAPTURE_BASE_CAPTURE_OFF (0u)

/** \brief Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU0 */
#define IFX_GTM_MON_STATUS_ACT_CMU0_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMU0 */
#define IFX_GTM_MON_STATUS_ACT_CMU0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMU0 */
#define IFX_GTM_MON_STATUS_ACT_CMU0_OFF (0u)

/** \brief Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU1 */
#define IFX_GTM_MON_STATUS_ACT_CMU1_LEN (1u)

