HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_4_4 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_4_4_OFF (4u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_4_5 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_4_5_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_4_5 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_4_5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_4_5 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_4_5_OFF (5u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_4_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_4_6_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_4_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_4_6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_4_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_4_6_OFF (6u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_4_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_4_7_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_4_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_4_7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_4_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_4_7_OFF (7u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_0 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_0_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_0 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_0 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_0_OFF (8u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_1 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_1_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_1 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_1 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_1_OFF (9u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_2 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_2_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_2 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_2 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_2_OFF (10u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_3 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_3_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_3 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_3 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_3_OFF (11u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_4 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_4_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_4 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_4 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_4_OFF (12u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_5 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_5_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_5 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_5 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_5_OFF (13u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_6_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_6_OFF (14u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_7_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_5_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_5_7_OFF (15u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_0 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_0_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_0 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_0 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_0_OFF (16u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_1 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_1_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_1 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_1 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_1_OFF (17u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_2 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_2_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_2 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_2 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_2_OFF (18u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_3 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_3_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_3 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_3 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_3_OFF (19u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_4 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_4_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_4 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_4 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_4_OFF (20u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_5 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_5_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_5 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_5 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_5_OFF (21u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_6_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_6_MSK (0x1u)

