HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH2_IRQ_OFF (26u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH3_IRQ_OFF (27u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH4_IRQ_OFF (28u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH5_IRQ_OFF (29u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH6_IRQ_OFF (30u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM3_CH7_IRQ_OFF (31u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH0_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH1_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH2_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH3_IRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH4_IRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH5_IRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH6_IRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM4_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM4_CH7_IRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM5_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM5_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM5_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM5_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM5_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM5_CH0_IRQ_OFF (8u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM5_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM5_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM5_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM5_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM5_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM5_CH1_IRQ_OFF (9u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM5_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM5_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM5_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM5_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM5_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM5_CH2_IRQ_OFF (10u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM5_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM5_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM5_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM5_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM5_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM5_CH3_IRQ_OFF (11u)

