HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM1_EIRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM2_EIRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM3_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM3_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM3_EIRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM4_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM4_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM4_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM4_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM4_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM4_EIRQ_OFF (8u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM5_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM5_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM5_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM5_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM5_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM5_EIRQ_OFF (9u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM6_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM6_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM6_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM6_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM6_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM6_EIRQ_OFF (10u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM7_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM7_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM7_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM7_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM7_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM7_EIRQ_OFF (11u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS0_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS0_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS0_EIRQ_OFF (12u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS1_EIRQ_OFF (13u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS2_EIRQ_OFF (14u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS3_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS3_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS3_EIRQ_OFF (15u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS4_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS4_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS4_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS4_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS4_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS4_EIRQ_OFF (16u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS5_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS5_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS5_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS5_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS5_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS5_EIRQ_OFF (17u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS6_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS6_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS6_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS6_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS6_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS6_EIRQ_OFF (18u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS7_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS7_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS7_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS7_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.MCS7_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_MCS7_EIRQ_OFF (19u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE0_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE0_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE0_EIRQ_OFF (20u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE1_EIRQ_OFF (21u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE2_EIRQ_OFF (22u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE3_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE3_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.SPE3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_SPE3_EIRQ_OFF (23u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.CMP_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CMP_EIRQ_LEN (1u)

