HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH1_EIRQ_OFF (25u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH2_EIRQ_OFF (26u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH3_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH3_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH3_EIRQ_OFF (27u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH4_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH4_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH4_EIRQ_OFF (28u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH5_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH5_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH5_EIRQ_OFF (29u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH6_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH6_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH6_EIRQ_OFF (30u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH7_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH7_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM3_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM3_CH7_EIRQ_OFF (31u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH0_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH0_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH0_EIRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH1_EIRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH2_EIRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH3_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH3_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH3_EIRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH4_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH4_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH4_EIRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH5_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH5_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH5_EIRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH6_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH6_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH6_EIRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH7_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH7_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH7_EIRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH0_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH0_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH0_EIRQ_OFF (8u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH1_EIRQ_OFF (9u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH2_EIRQ_OFF (10u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH3_EIRQ_LEN (1u)

