HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH1_EIRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH2_EIRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH3_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH3_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH3_EIRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH4_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH4_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH4_EIRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH5_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH5_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH5_EIRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH6_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH6_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH6_EIRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH7_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH7_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_MCS_Bits.MCS_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_MCS_MCS_CH7_EIRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH0_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH0_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH0_EIRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH1_EIRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH2_EIRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH3_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH3_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH3_EIRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH4_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH4_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH4_EIRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH5_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH5_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH5_EIRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH6_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH6_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH6_EIRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH7_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH7_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M0_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M0_CH7_EIRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH0_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH0_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M1_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M1_CH0_EIRQ_OFF (8u)

