HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_CANOUTSEL0_Bits.SEL1 */
#define IFX_GTM_CANOUTSEL0_SEL1_OFF (4u)

/** \brief Length for Ifx_GTM_CANOUTSEL0_Bits.SEL2 */
#define IFX_GTM_CANOUTSEL0_SEL2_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL0_Bits.SEL2 */
#define IFX_GTM_CANOUTSEL0_SEL2_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL0_Bits.SEL2 */
#define IFX_GTM_CANOUTSEL0_SEL2_OFF (8u)

/** \brief Length for Ifx_GTM_CANOUTSEL0_Bits.SEL3 */
#define IFX_GTM_CANOUTSEL0_SEL3_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL0_Bits.SEL3 */
#define IFX_GTM_CANOUTSEL0_SEL3_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL0_Bits.SEL3 */
#define IFX_GTM_CANOUTSEL0_SEL3_OFF (12u)

/** \brief Length for Ifx_GTM_CANOUTSEL0_Bits.SEL4 */
#define IFX_GTM_CANOUTSEL0_SEL4_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL0_Bits.SEL4 */
#define IFX_GTM_CANOUTSEL0_SEL4_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL0_Bits.SEL4 */
#define IFX_GTM_CANOUTSEL0_SEL4_OFF (16u)

/** \brief Length for Ifx_GTM_CANOUTSEL0_Bits.SEL5 */
#define IFX_GTM_CANOUTSEL0_SEL5_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL0_Bits.SEL5 */
#define IFX_GTM_CANOUTSEL0_SEL5_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL0_Bits.SEL5 */
#define IFX_GTM_CANOUTSEL0_SEL5_OFF (20u)

/** \brief Length for Ifx_GTM_CANOUTSEL0_Bits.SEL6 */
#define IFX_GTM_CANOUTSEL0_SEL6_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL0_Bits.SEL6 */
#define IFX_GTM_CANOUTSEL0_SEL6_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL0_Bits.SEL6 */
#define IFX_GTM_CANOUTSEL0_SEL6_OFF (24u)

/** \brief Length for Ifx_GTM_CANOUTSEL0_Bits.SEL7 */
#define IFX_GTM_CANOUTSEL0_SEL7_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL0_Bits.SEL7 */
#define IFX_GTM_CANOUTSEL0_SEL7_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL0_Bits.SEL7 */
#define IFX_GTM_CANOUTSEL0_SEL7_OFF (28u)

/** \brief Length for Ifx_GTM_CANOUTSEL1_Bits.SEL0 */
#define IFX_GTM_CANOUTSEL1_SEL0_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL1_Bits.SEL0 */
#define IFX_GTM_CANOUTSEL1_SEL0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL1_Bits.SEL0 */
#define IFX_GTM_CANOUTSEL1_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_CANOUTSEL1_Bits.SEL1 */
#define IFX_GTM_CANOUTSEL1_SEL1_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL1_Bits.SEL1 */
#define IFX_GTM_CANOUTSEL1_SEL1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL1_Bits.SEL1 */
#define IFX_GTM_CANOUTSEL1_SEL1_OFF (4u)

/** \brief Length for Ifx_GTM_CANOUTSEL1_Bits.SEL2 */
#define IFX_GTM_CANOUTSEL1_SEL2_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL1_Bits.SEL2 */
#define IFX_GTM_CANOUTSEL1_SEL2_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL1_Bits.SEL2 */
#define IFX_GTM_CANOUTSEL1_SEL2_OFF (8u)

/** \brief Length for Ifx_GTM_CANOUTSEL1_Bits.SEL3 */
#define IFX_GTM_CANOUTSEL1_SEL3_LEN (4u)

/** \brief Mask for Ifx_GTM_CANOUTSEL1_Bits.SEL3 */
#define IFX_GTM_CANOUTSEL1_SEL3_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CANOUTSEL1_Bits.SEL3 */
#define IFX_GTM_CANOUTSEL1_SEL3_OFF (12u)

/** \brief Length for Ifx_GTM_CCM_ARP_CTRL_Bits.ADDR */
#define IFX_GTM_CCM_ARP_CTRL_ADDR_LEN (16u)

/** \brief Mask for Ifx_GTM_CCM_ARP_CTRL_Bits.ADDR */
#define IFX_GTM_CCM_ARP_CTRL_ADDR_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_CCM_ARP_CTRL_Bits.ADDR */
#define IFX_GTM_CCM_ARP_CTRL_ADDR_OFF (0u)

/** \brief Length for Ifx_GTM_CCM_ARP_CTRL_Bits.SIZE */
#define IFX_GTM_CCM_ARP_CTRL_SIZE_LEN (4u)

/** \brief Mask for Ifx_GTM_CCM_ARP_CTRL_Bits.SIZE */
#define IFX_GTM_CCM_ARP_CTRL_SIZE_MSK (0xfu)

/** \brief Offset for Ifx_GTM_CCM_ARP_CTRL_Bits.SIZE */
#define IFX_GTM_CCM_ARP_CTRL_SIZE_OFF (16u)

/** \brief Length for Ifx_GTM_CCM_ARP_CTRL_Bits.DIS_PROT */
#define IFX_GTM_CCM_ARP_CTRL_DIS_PROT_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_CTRL_Bits.DIS_PROT */
#define IFX_GTM_CCM_ARP_CTRL_DIS_PROT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_CTRL_Bits.DIS_PROT */
#define IFX_GTM_CCM_ARP_CTRL_DIS_PROT_OFF (24u)

/** \brief Length for Ifx_GTM_CCM_ARP_CTRL_Bits.WPROT_AEI */
#define IFX_GTM_CCM_ARP_CTRL_WPROT_AEI_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_CTRL_Bits.WPROT_AEI */
#define IFX_GTM_CCM_ARP_CTRL_WPROT_AEI_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_CTRL_Bits.WPROT_AEI */
#define IFX_GTM_CCM_ARP_CTRL_WPROT_AEI_OFF (31u)

/** \brief Length for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT0 */
#define IFX_GTM_CCM_ARP_PROT_WPROT0_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT0 */
#define IFX_GTM_CCM_ARP_PROT_WPROT0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT0 */
#define IFX_GTM_CCM_ARP_PROT_WPROT0_OFF (0u)

/** \brief Length for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT1 */
#define IFX_GTM_CCM_ARP_PROT_WPROT1_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT1 */
#define IFX_GTM_CCM_ARP_PROT_WPROT1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT1 */
#define IFX_GTM_CCM_ARP_PROT_WPROT1_OFF (1u)

/** \brief Length for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT2 */
#define IFX_GTM_CCM_ARP_PROT_WPROT2_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT2 */
#define IFX_GTM_CCM_ARP_PROT_WPROT2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT2 */
#define IFX_GTM_CCM_ARP_PROT_WPROT2_OFF (2u)

/** \brief Length for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT3 */
#define IFX_GTM_CCM_ARP_PROT_WPROT3_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT3 */
#define IFX_GTM_CCM_ARP_PROT_WPROT3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT3 */
#define IFX_GTM_CCM_ARP_PROT_WPROT3_OFF (3u)

/** \brief Length for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT4 */
#define IFX_GTM_CCM_ARP_PROT_WPROT4_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT4 */
#define IFX_GTM_CCM_ARP_PROT_WPROT4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT4 */
#define IFX_GTM_CCM_ARP_PROT_WPROT4_OFF (4u)

/** \brief Length for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT5 */
#define IFX_GTM_CCM_ARP_PROT_WPROT5_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT5 */
#define IFX_GTM_CCM_ARP_PROT_WPROT5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT5 */
#define IFX_GTM_CCM_ARP_PROT_WPROT5_OFF (5u)

