HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_0_OFF (0u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_0_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_0_OFF (1u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_0_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_0_OFF (2u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_0_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_0_OFF (3u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_0_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_0_OFF (4u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_0_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_0_OFF (5u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_0_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_0_OFF (6u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_0_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_0 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_0_OFF (7u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_1_OFF (8u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_1_OFF (9u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_1_OFF (10u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT0_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT0_1_OFF (11u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL1_1_OFF (12u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC1_1_OFF (13u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL1_1_OFF (14u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_1_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.DT1_1 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_DT1_1_OFF (15u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_2_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.POL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_POL0_2_OFF (16u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_2_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.OC0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_OC0_2_OFF (17u)

/** \brief Length for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_2_LEN (1u)

/** \brief Mask for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CDTM_DTM_CH_CTRL2_Bits.SL0_2 */
#define IFX_GTM_CDTM_DTM_CH_CTRL2_SL0_2_OFF (18u)

