HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG7 */
#define IFX_GTM_MCS_CH_CTRG_TRG7_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG7 */
#define IFX_GTM_MCS_CH_CTRG_TRG7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG7 */
#define IFX_GTM_MCS_CH_CTRG_TRG7_OFF (7u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG8 */
#define IFX_GTM_MCS_CH_CTRG_TRG8_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG8 */
#define IFX_GTM_MCS_CH_CTRG_TRG8_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG8 */
#define IFX_GTM_MCS_CH_CTRG_TRG8_OFF (8u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG9 */
#define IFX_GTM_MCS_CH_CTRG_TRG9_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG9 */
#define IFX_GTM_MCS_CH_CTRG_TRG9_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG9 */
#define IFX_GTM_MCS_CH_CTRG_TRG9_OFF (9u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG10 */
#define IFX_GTM_MCS_CH_CTRG_TRG10_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG10 */
#define IFX_GTM_MCS_CH_CTRG_TRG10_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG10 */
#define IFX_GTM_MCS_CH_CTRG_TRG10_OFF (10u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG11 */
#define IFX_GTM_MCS_CH_CTRG_TRG11_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG11 */
#define IFX_GTM_MCS_CH_CTRG_TRG11_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG11 */
#define IFX_GTM_MCS_CH_CTRG_TRG11_OFF (11u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG12 */
#define IFX_GTM_MCS_CH_CTRG_TRG12_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG12 */
#define IFX_GTM_MCS_CH_CTRG_TRG12_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG12 */
#define IFX_GTM_MCS_CH_CTRG_TRG12_OFF (12u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG13 */
#define IFX_GTM_MCS_CH_CTRG_TRG13_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG13 */
#define IFX_GTM_MCS_CH_CTRG_TRG13_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG13 */
#define IFX_GTM_MCS_CH_CTRG_TRG13_OFF (13u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG14 */
#define IFX_GTM_MCS_CH_CTRG_TRG14_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG14 */
#define IFX_GTM_MCS_CH_CTRG_TRG14_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG14 */
#define IFX_GTM_MCS_CH_CTRG_TRG14_OFF (14u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG15 */
#define IFX_GTM_MCS_CH_CTRG_TRG15_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG15 */
#define IFX_GTM_MCS_CH_CTRG_TRG15_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG15 */
#define IFX_GTM_MCS_CH_CTRG_TRG15_OFF (15u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG16 */
#define IFX_GTM_MCS_CH_CTRG_TRG16_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG16 */
#define IFX_GTM_MCS_CH_CTRG_TRG16_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG16 */
#define IFX_GTM_MCS_CH_CTRG_TRG16_OFF (16u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG17 */
#define IFX_GTM_MCS_CH_CTRG_TRG17_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG17 */
#define IFX_GTM_MCS_CH_CTRG_TRG17_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG17 */
#define IFX_GTM_MCS_CH_CTRG_TRG17_OFF (17u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG18 */
#define IFX_GTM_MCS_CH_CTRG_TRG18_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG18 */
#define IFX_GTM_MCS_CH_CTRG_TRG18_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG18 */
#define IFX_GTM_MCS_CH_CTRG_TRG18_OFF (18u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG19 */
#define IFX_GTM_MCS_CH_CTRG_TRG19_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG19 */
#define IFX_GTM_MCS_CH_CTRG_TRG19_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG19 */
#define IFX_GTM_MCS_CH_CTRG_TRG19_OFF (19u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG20 */
#define IFX_GTM_MCS_CH_CTRG_TRG20_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG20 */
#define IFX_GTM_MCS_CH_CTRG_TRG20_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG20 */
#define IFX_GTM_MCS_CH_CTRG_TRG20_OFF (20u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG21 */
#define IFX_GTM_MCS_CH_CTRG_TRG21_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG21 */
#define IFX_GTM_MCS_CH_CTRG_TRG21_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG21 */
#define IFX_GTM_MCS_CH_CTRG_TRG21_OFF (21u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG22 */
#define IFX_GTM_MCS_CH_CTRG_TRG22_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG22 */
#define IFX_GTM_MCS_CH_CTRG_TRG22_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG22 */
#define IFX_GTM_MCS_CH_CTRG_TRG22_OFF (22u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG23 */
#define IFX_GTM_MCS_CH_CTRG_TRG23_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG23 */
#define IFX_GTM_MCS_CH_CTRG_TRG23_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG23 */
#define IFX_GTM_MCS_CH_CTRG_TRG23_OFF (23u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH_STRG_TRG0_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH_STRG_TRG0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH_STRG_TRG0_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG1 */
#define IFX_GTM_MCS_CH_STRG_TRG1_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG1 */
#define IFX_GTM_MCS_CH_STRG_TRG1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG1 */
#define IFX_GTM_MCS_CH_STRG_TRG1_OFF (1u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG2 */
#define IFX_GTM_MCS_CH_STRG_TRG2_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG2 */
#define IFX_GTM_MCS_CH_STRG_TRG2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG2 */
#define IFX_GTM_MCS_CH_STRG_TRG2_OFF (2u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG3 */
#define IFX_GTM_MCS_CH_STRG_TRG3_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG3 */
#define IFX_GTM_MCS_CH_STRG_TRG3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG3 */
#define IFX_GTM_MCS_CH_STRG_TRG3_OFF (3u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG4 */
#define IFX_GTM_MCS_CH_STRG_TRG4_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG4 */
#define IFX_GTM_MCS_CH_STRG_TRG4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG4 */
#define IFX_GTM_MCS_CH_STRG_TRG4_OFF (4u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG5 */
#define IFX_GTM_MCS_CH_STRG_TRG5_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG5 */
#define IFX_GTM_MCS_CH_STRG_TRG5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG5 */
#define IFX_GTM_MCS_CH_STRG_TRG5_OFF (5u)

